# ДЗ №1
# Задание 1-9
a1="Пример строки"    # Создать переменную типа String (строка)
a2=5                  # Создать переменную типа Integer (целые числа)
a3=7.7                # Создать переменную типа Float (числа с плавающей точкой)
a4=bytes([1,51,255])  # Создать переменную типа Bytes (последовательность чисел в диапазоне 0-255)
a5=['a','b','c',2]    # Создать переменную типа List (значения в [] скобках)
a6=('d',5,'c')        # Создать переменную типа Tuple/кортеж ( / в () скобках, через запятую)
a7={1,2,3,4,'g'}      # Создать переменную типа Set/Множество (в {} скобках или set(''text))
a8=frozenset('text')  # Создать переменную типа Frozen set
a9= {'text': 7}       # Создать переменную типа Dict

#10 Вывести в консоль все выше перечисленные переменные с добавлением типа данных.
print('Type_a1=',type(a1))
print('Type_a2=',type(a2))
print('Type_a3=',type(a3))
print('Type_a4=',type(a4))
print('Type_a5=',type(a5))
print('Type_a6=',type(a6))
print('Type_a7=',type(a7))
print('Type_a8=',type(a8))
print('Type_a9=',type(a9))

#11 Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.
a="Маша "
b="Миша"
c=a+b
print(c)

#12 Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)
print(a1, a2, sep=",")

#13 Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)
print(a1, a2, sep="+")

