# Задача №1
# Обменник. Создать скрипт который будет запускаться из консоли 1 раз из консоли, выдавать результат и зарываться.
#     1. На вход обменнику вводишь количество денег int.
#     2. На выходе в консоль выводится отввет в таком виде:
#                 "Ты ввёл int (Валюта)"
#                 "конвертированная сумма в USD = int"
# #     3. Валюту пользователя определите сами.

money = int(input('Ведите количество денег:'))
print('Ты ввёл', money, 'RUB')
print('Конвертированная сумма в USD = ', round(money / 77.6, 2), '$')

print()
print('====================НАЧАЛО ВТОРОЙ ЗАДАЧИ======================')

# # Задача №2
# # Обменник. Создать скрипт который будет запускаться из консоли 1 раз из консоли, выдавать результат и зарываться.
# #     1. На вход обменнику вводишь количество денег int.
# #     2. На выходе в консоль выводится отввет в таком виде:
# #                 "Ты ввёл int (Валюта)"
# #                 "Конвертированная сумма в USD = int"
# #                 "Конвертированная сумма в EUR = int"
# #                 "Конвертированная сумма в CHF = int"
# #                 "Конвертированная сумма в GBP = int"
# #                 "Конвертированная сумма в CNY = int"
# #     3. Валюту пользователя определите сами.


money = int(input('Ведите количество денег:'))
print('Ты ввёл', money, 'RUB')
print('Конвертированная сумма в USD = ', round(money / 77.6, 2), '$')
print('Конвертированная сумма в EUR = ', round(money / 87.8, 2), '€')
print('Конвертированная сумма в CHF = ', round(money / 84.8, 2), '₣')
print('Конвертированная сумма в GBP = ', round(money / 104.9, 2), '£')
print('Конвертированная сумма в CNY = ', round(money / 12.1, 2), '¥')

print()
print('====================НАЧАЛО ТРЕТЬЕЙ ЗАДАЧИ======================')
# # 3.
# Скипт должен выдать сообщение
# "Введите положительное число." Если число меньше 0.
# "Вы ввели не число. Введите число." Если введены буквы.
# "Вы ввели пустое поле. Введите число." Если введено пустое значение.
print('============================================================================')

while True:
    money = input('Ведите количество денег:')
    if money == "":
         print('Вы ввели пустое поле. Введите число')
         continue
    try:
        money != int(money)
    except ValueError:
        print('Вы ввели не число. Введите число.')
        continue
    if int(money) < 0:
        print('Введите положительное число')
        continue

    money = int(money)
    print('Ты ввёл', money, 'RUB')
    print('Конвертированная сумма в USD = ', round(money / 77.6, 2), '$')
    print('Конвертированная сумма в EUR = ', round(money / 87.8, 2), '€')
    print('Конвертированная сумма в CHF = ', round(money / 84.8, 2), '₣')
    print('Конвертированная сумма в GBP = ', round(money / 104.9, 2), '£')
    print('Конвертированная сумма в CNY = ', round(money / 12.1, 2), '¥')
    break

print()
print('====================НАЧАЛО ЧЕТВЕРТОЙ ЗАДАЧИ======================')
# Обменник. Скрипт запускается в консоли и работает постоянно. Остановится нажатием ctrl+c.
#     1. Скрипт сначала выводит "Выберите валюту из ['USD','EUR','CHF','GBP','CNY']"
#     2. Пользователь вводит один из 5 вариантов ['USD','EUR','CHF','GBP','CNY']
#     3. Потом Скрипт выводит "Введите сумму"
#     4. Пользователь вводит сумму int
#     5. Скрипт выводит:
#             "Вы ввели сумму int и валюту "Валюта" "
#             "конвертированная сумма в "Валюта" = int"
#     6. Скипт должен выдать сообщение
#                 "Введите положительное число." Если число меньше 0.
#                 "Вы ввели не число. Введите число." Если введены буквы.
#                 "Вы ввели пустое поле. Введите число." Если введено пустое значение.
#     7. После сообщеня об ошибке, скрипт должен автоматом вернуться к шагу 1.
#     8. Валюту пользователя определите сами.


while True:
    Currency = input("Выберите валюту из 'USD','EUR','CHF','GBP','CNY':")
    Sum = input('Введите сумму:')
    if Sum == "":
        print('Вы ввели пустое поле. Введите число')
        continue
    try:
        Sum != int(Sum)
    except ValueError:
        print('Вы ввели не число. Введите число.')
        continue
    if int(Sum) < 0:
        print('Введите положительное число')
        continue
    if Currency == 'USD':
        print('Вы ввели сумму', Sum, 'и валюту USD')
        print('Конвертированная сумма в RUB =', int(Sum) * 79)
    if Currency == 'EUR':
        print('Вы ввели сумму', Sum, 'и валюту EUR')
        print('Конвертированная сумма в RUB =', int(Sum) * 89)
    if Currency == 'CHF':
        print('Вы ввели сумму', Sum, 'и валюту CHF')
        print('Конвертированная сумма в RUB =', int(Sum) * 85)
    if Currency == 'GBP':
        print('Вы ввели сумму', Sum, 'и валюту GBP')
        print('Конвертированная сумма в RUB =', int(Sum) * 105)
    if Currency == 'CNY':
        print('Вы ввели сумму', Sum, 'и валюту CNY')
        print('Конвертированная сумма в RUB =', int(Sum) * 12.4)